---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecNumberOfPoles
source: html/40b56da0-8b1a-61fb-948f-02e68abbf453.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecNumberOfPoles Property

"Number of Poles"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecNumberOfPoles { get; }
```